# Coding Exercises (Part 1)

## Full Data Workflow A-Z: Merging, Joining, Concatenating

### Exercise 12: Merging, joining, aligning and concatenating Data

Now, you will have the opportunity to analyze your own dataset. <br>
__Follow the instructions__ and insert your code! You are either requested to 
- Complete the Code and __Fill in the gaps__. Gaps are marked with "__---__" and are __placeholders__ for your code fragment. 
- Write Code completely __on your own__

In some exercises, you will find questions that can only be answered, if your code is correct and returns the right output! The correct answer is provided below your coding cell. There you can check whether your code is correct.

If you need a hint, check the __Hints Section__ at the end of this Notebook. Exercises and Hints are numerated accordingly.

If you need some further help or if you want to check your code, you can also check the __solutions notebook__.

### Have Fun!

--------------------------------------------------------------------------------------------------------------

## Option 1: Self_guided

### Concatenating DataFrames vertically

__Import__ the cars dataset (with cars from usa and europe) from the csv-file __cars_clean.csv__. <br>
Also __import__ the csv-file __cars_jap.csv__ (with cars from japan) and __concatenate__ both DataFrames __vertically__! <br>
__Save__ the __concatenated DataFrame__ in the variable __cars_all__! <br>
Finally, __sort__ cars_all by the model_year from __low to high__!

In [1]:
import pandas as pd

In [13]:
cars1 = pd.read_csv("cars_clean.csv")
cars2 = pd.read_csv("cars_jap.csv")

In [14]:
cars1

,Unnamed: 0,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino
...,...,...,...,...,...,...,...,...,...,...
314,314,27.0,4,140.0,86.0,2790,15.6,82,usa,ford mustang gl
315,315,44.0,4,97.0,52.0,2130,24.6,82,europe,vw pickup
316,316,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge rampage
317,317,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger
318,318,31.0,4,119.0,82.0,2720,19.4,82,usa,chevrolet s-10

In [27]:
cars1 = cars1.drop(axis = 1, labels = "Unnamed: 0")

In [4]:
cars2

     mpg  cyl   disp    hp  weight   acc  year                   name
0   24.0    4  113.0  95.0    2372  15.0    70  toyota corona mark ii
1   27.0    4   97.0  88.0    2130  14.5    70           datsun pl510
2   27.0    4   97.0  88.0    2130  14.5    71           datsun pl510
3   25.0    4  113.0  95.0    2228  14.0    71          toyota corona
4   31.0    4   71.0  65.0    1773  19.0    71    toyota corolla 1200
..   ...  ...    ...   ...     ...   ...   ...                    ...
74  34.0    4  108.0  70.0    2245  16.9    82         toyota corolla
75  38.0    4   91.0  67.0    1965  15.0    82            honda civic
76  32.0    4   91.0  67.0    1965  15.7    82     honda civic (auto)
77  38.0    4   91.0  67.0    1995  16.2    82          datsun 310 gx
78  32.0    4  144.0  96.0    2665  13.9    82       toyota celica gt

[79 rows x 8 columns]

In [17]:
cars2.insert(loc = 7, column = "origin", value = "jap")

In [18]:
cars2

     mpg  cyl   disp    hp  weight   acc  year origin                   name
0   24.0    4  113.0  95.0    2372  15.0    70    jap  toyota corona mark ii
1   27.0    4   97.0  88.0    2130  14.5    70    jap           datsun pl510
2   27.0    4   97.0  88.0    2130  14.5    71    jap           datsun pl510
3   25.0    4  113.0  95.0    2228  14.0    71    jap          toyota corona
4   31.0    4   71.0  65.0    1773  19.0    71    jap    toyota corolla 1200
..   ...  ...    ...   ...     ...   ...   ...    ...                    ...
74  34.0    4  108.0  70.0    2245  16.9    82    jap         toyota corolla
75  38.0    4   91.0  67.0    1965  15.0    82    jap            honda civic
76  32.0    4   91.0  67.0    1965  15.7    82    jap     honda civic (auto)
77  38.0    4   91.0  67.0    1995  16.2    82    jap          datsun 310 gx
78  32.0    4  144.0  96.0    2665  13.9    82    jap       toyota celica gt

[79 rows x 9 columns]

In [24]:
cars2.rename({"cyl":"cylinders", "disp":"displacement", "hp":"horsepower", "acc":"acceleration", "year":"model_year"}, axis = 1, inplace = True)

In [29]:
cars_all = pd.concat([cars1, cars2])

In [31]:
cars_all.sort_values("model_year", inplace=True)

### Left Join

__Import__ the csv-files __summer.csv__ (as summer) and __dictionary.csv__ (as dic) which contains the __full country name__ for the olympic country codes as well as __population__ and __gdp__ statistics for some countries.<br>

__"Copy and paste"__ the __full country name__, __population__ and __gdp__ from the dic DataFrame __into the summer DataFrame__ with a __Left Join__!<br>
__Save__ the new merged DataFrame in the variable __summer_new__!<br>

__Inspect__ summer_new and determine the __olympic country codes__ for which the dic DataFrame does __not provide__ any information!

In [32]:
summer = pd.read_csv("summer.csv")
dic = pd.read_csv("dictionary.csv")

In [33]:
summer

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver
...,...,...,...,...,...,...,...,...,...
31160,2012,London,Wrestling,Wrestling Freestyle,"JANIKOWSKI, Damian",POL,Men,Wg 84 KG,Bronze
31161,2012,London,Wrestling,Wrestling Freestyle,"REZAEI, Ghasem Gholamreza",IRI,Men,Wg 96 KG,Gold
31162,2012,London,Wrestling,Wrestling Freestyle,"TOTROV, Rustam",RUS,Men,Wg 96 KG,Silver
31163,2012,London,Wrestling,Wrestling Freestyle,"ALEKSANYAN, Artur",ARM,Men,Wg 96 KG,Bronze
31164,2012,London,Wrestling,Wrestling Freestyle,"LIDBERG, Jimmy",SWE,Men,Wg 96 KG,Bronze

In [34]:
dic

             Country Code  Population  GDP per Capita
0        Afghanistan  AFG  32526562.0      594.323081
1            Albania  ALB   2889167.0     3945.217582
2            Algeria  ALG  39666519.0     4206.031232
3    American Samoa*  ASA     55538.0             NaN
4            Andorra  AND     70473.0             NaN
..               ...  ...         ...             ...
196          Vietnam  VIE  91703800.0     2111.138024
197  Virgin Islands*  ISV    103574.0             NaN
198            Yemen  YEM  26832215.0     1406.291651
199           Zambia  ZAM  16211767.0     1304.879014
200         Zimbabwe  ZIM  15602751.0      924.143819

[201 rows x 4 columns]

In [38]:
summer_new = pd.merge(summer, dic, how = "left", left_on="Country", right_on="Code", suffixes=("_drop", "_name"))

In [42]:
summer_new.drop("Country_drop", axis = 1, inplace = True)

In [48]:
summer_new.isnull().value_counts() ##??

Year   City   Sport  Discipline  Athlete  Gender  Event  Medal  Country_name  Code   Population  GDP per Capita
False  False  False  False       False    False   False  False  False         False  False       False             25142
                                                                True          True   True        True               5423
                                                                False         False  False       True                554
                                                                                     True        True                 46
dtype: int64

### Arithmetic operations between DataFrames / Alignment

__Import__ the csv-files __ath_2008.csv__ and __ath_2012.csv__ with all medals winners in the Sport __Athletics__ in the Editions __2008__ and __2012__.

For __all Athletes__ in the two DataFrames, __aggregate/add__ the total number of __Gold__, __Silver__ and __Bronze__ Medals over both editions! __Save__ the aggregated DataFrame in the variable __add__. (Hint: add should contain an index with the Athlete names and three columns, Gold, Silver, Bronze)

__Sort__ add by Gold, Silver, Bronze from __high to low__! Change datatype to __integer__, if necessary! The first Athlete in your DataFrame should be ... no surprise ... Usain Bolt with 6 Gold and 0 Silver and Bronze Medals.

In [52]:
medals08 = pd.read_csv("ath_2008.csv", index_col="Athlete")
medals12 = pd.read_csv("ath_2012.csv", index_col="Athlete")

In [53]:
medals08

                    Gold  Silver  Bronze
Athlete
ABAKUMOVA, Maria       0       1       0
ABEYLEGESSE, Elvan     0       2       0
ALEKNA, Virgilijus     0       0       1
ALEXEEV, Denis         0       0       1
ANTONOVA, Olena        0       0       1
...                  ...     ...     ...
WINEBERG, Mary         1       0       0
YEGO, Alfred Kirwa     0       0       1
YURCHENKO, Denys       0       0       1
ZHANG, Wenxiu          0       0       1
ZHOU, Chunxiu          0       0       1

[159 rows x 3 columns]

In [54]:
medals12

                         Gold  Silver  Bronze
Athlete
ADAMS, Valerie              1       0       0
ALLEYNE-FORTE, Ade          0       0       1
AMOS, Nijel                 0       1       0
ANTYUKH, Natalya            1       1       0
ASSEFA, Sofia               0       1       0
...                       ...     ...     ...
WILLIAMS, Lauryn            1       0       0
WILLIAMS, Shericka          0       0       1
WILLIAMS-MILLS, Novlene     0       0       1
WLODARCZYK, Anita           1       0       0
ZHANG, Wenxiu               0       0       1

[171 rows x 3 columns]

In [58]:
add = medals08.add(medals12, fill_value=0)

In [63]:
add.sort_values(["Gold", "Silver", "Bronze"], ascending=False).astype("int")

                         Gold  Silver  Bronze
Athlete
BOLT, Usain                 6       0       0
FELIX, Allyson              4       1       0
DIBABA, Tirunesh            3       0       1
TAYLOR, Angelo              2       1       0
BEKELE, Kenenisa            2       0       0
...                       ...     ...     ...
WILLIAMS, Novelene          0       0       1
WILLIAMS-MILLS, Novlene     0       0       1
YEGO, Alfred Kirwa          0       0       1
YURCHENKO, Denys            0       0       1
ZHOU, Chunxiu               0       0       1

[298 rows x 3 columns]

-------------------------------------

## Option 2: Guided and Instructed

# STOP HERE, IF YOU WANT TO DO THE EXERCISE ON YOUR OWN!

+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

In [ ]:
#run the cell
import pandas as pd

### Concatenating DataFrames vertically

In [ ]:
#run the cell
cars = pd.read_csv("cars_clean.csv")

__Inspect__ the __cars__ DataFrame!

In [ ]:
#run the cell
cars.head()

In [ ]:
#run the cell
cars.tail()

In [ ]:
#run the cell
cars.info()

__Inspect__ the cars_jap DataFrame!

In [ ]:
#run the cell
cars_jap = pd.read_csv("cars_jap.csv")

In [ ]:
#run the cell
cars_jap.head()

Before we can concatenate both DataFrames, we need to __align__ them!<br>
108. __Insert__ the column __origin__ to __cars_jap__ at the most appropriate position! __Fill in the gaps!__

In [ ]:
cars_jap.---(---, ---, "japan")

Also the column labels should match. <br>
109. __Overwrite__ the column labels in __cars_jap__ and use the same column labels that we have in cars!

__Inspect__!

In [ ]:
#run the cell
cars_jap.head()

110. __Concatenate__ both DataFrames __vertically__ and create a __new RangeIndex__! __Save__ the new DataFrame in the variable __cars_all__!

__Inspect__!

In [ ]:
#run the cell
cars_all.head()

In [ ]:
#run the cell!
cars_all.tail()

111. __Sort cars_call__ by the __model_year__ from __low to high__! Create a __new RangeIndex__ (drop the old)! __Fill in the gaps__!

In [ ]:
cars_all = cars_all.---("model_year").---(drop = True)

__Inspect__!

In [ ]:
#run the cell
cars_all.head()

In [ ]:
#run the cell
cars_all.tail()

In [ ]:
#run the cell
cars_all.info()

----------------------------------------------------------------------

### Left Join

In [ ]:
# run the cell!
summer = pd.read_csv("summer.csv")

__Inspect__ the __summer__ DataFrame!

In [ ]:
# run the cell!
summer.head()

In [ ]:
# run the cell!
dic = pd.read_csv("dictionary.csv")

__Inspect__ dict!

In [ ]:
# run the cell!
dic.head()

__dic__ contains the Olympic Games __Country Codes__ ("Code") with the corresponding __full country names__ ("Country") as well as recent __Population__ and __GDP__ statistics.<br>

112. __Create__ the columns __Country__, __Population__ and __GDP per Capita__ in the __summer__ DataFrame by using a __Left Join__ with __pd.merge()__. <br>
__Save__ the merged Dataframe in the variable __summer_new__! __Fill in the gaps__!

In [ ]:
summer_new = pd.merge(---, ---, how = "left", left_on= ---, right_on = ---)

__Inspect__ summer_new!

In [ ]:
# run the cell!
summer_new.head()

In [ ]:
# run the cell!
summer_new.info()

Apparently, __dic__ does __not contain__ additional information for __all olympic country codes__ that are in the __summer__ Dataframe.

113. __Filter__ summer_new for the elements in the column __Country_x__, where the __corresponding value__ in the column __Code__ is __missing__! <br>
__Count__ the frequency! __Fill in the gaps__!

In [ ]:
summer_new.loc[summer_new.Code.---, "Country_x"].---

For these country codes, we need to find __other sources__ for additional information on the __full country name__, __population__ and __gdp__ (most of these countries do not exist any more.) -> BONUS EXERCISE ;-)

--------------------------

### Arithmetic operations between DataFrames / Alignment

In [ ]:
#run the cell
ath_2008 = pd.read_csv("ath_2008.csv")
ath_2012 = pd.read_csv("ath_2012.csv")

__Inspect__ the __ath_2008__ DataFrame. It contains all athletes who won medals in __Athletics__ in the Edition __2008__.

In [ ]:
#run the cell
ath_2008.head()

In [ ]:
#run the cell
ath_2008.info()

__Inspect__ the __ath_2012__ DataFrame. It contains all athletes who won medals in __Athletics__ in the Edition __2012__.

In [ ]:
#run the cell
ath_2012.head()

In [ ]:
#run the cell
ath_2012.info()

For __all Athletes__ in the two DataFrames, __aggregate/add__ the total number of __Gold__, __Silver__ and __Bronze__ Medals over both editions! __Save__ the aggregated DataFrame in the variable __add__!

114. First, __set__ the __Athlete__ column as the __index__ in both DataFrames! __Save__ the changes!

115. __Add__ both DataFrames with the __most appropriate method__! __Save__ the resulting DataFrame in the variable __add__!

__Inspect__!

In [ ]:
#run the cell
add.head(10)

116. __Sort__ the athletes by the number of __Gold__, __Silver__ and __Bronze__ medals from __high to low__!<br>
__Fill in the gaps!__ Who is the top athlete?

In [ ]:
add = add.sort_values(---, ascending = ---).astype("int")

In [ ]:
# run the cell!
add.head()

In [ ]:
# run the cell!
add.tail()

No surprise, itÂ´s Usain Bolt!

# Well Done!

------------------------------------------------

# Hints (Spoiler!)

108. insert() method, index pos. 7

109. columns attribute

110. pd.concat() method, ignore index

111. methods sort_values() and reset_index()

112. left DataFrame: summer, on "Country" and "Code"

113. methods isnull() and value_counts()

114. set_index() method

115. add() method, fill_value = 0

116. pass a list of columns to sort_values() method (sequence matters!)